name: AD User Password Never Expires Flag Set
description: |
  Foydalanuvchi akkauntining "Password Never Expires" opsiyasi yoqilganini aniqlaydi (Event ID 4738).
  Bu xavfsizlik siyosatiga zid bo'lishi va hujumchi tomonidan ishlatilishi mumkin.
type: esql
params: '{}'
schedule_interval: 15m
index:
- logs-winlog*
query_language: esql
query: |
  FROM logs-winlog*
  | WHERE event.code == "4738"
  /* MS Windows Security auditingga ko'ra 'UserAccountControl' o'zgarishi */
  | EVAL actor = winlog.event_data.SubjectUserName
  | EVAL target_user = winlog.event_data.TargetUserName
  /* Password Never Expires flag o'zgarganda logda ma'lumot keladi */
  | KEEP @timestamp, winlog.computer_name, actor, target_user, event.code
  | SORT @timestamp DESC
enabled: false
tags:
  - detection.persistence
  - monitoring.account_properties
severity: medium
risk_score: 55
nist: []
pci_dss: []
gdpr: []
mitre_attack: []