rule_id: 84e6a0ea-0099-4966-a234-cc09e11b53b6
name: "Doas Configuration File Creation"
description: |
  Detects the creation of doas.conf file.
  Doas is a sudo alternative; checking for its config creation can indicate privilege escalation attempts or unauthorized configuration.
type: esql
params: '{}'
schedule_interval: 10m
index:
  - logs-updive.audit-*
query_language: esql
query: |
  FROM logs-updive.audit-*
  /* file creation events */
  | WHERE event.category == "file" AND event.type == "creation"
  /* selection: doas.conf */
  | WHERE file.path RLIKE "(?i)/etc/doas\\.conf$"
  | STATS
      event_count = COUNT(*),
      users = VALUES(user.name),
      processes = VALUES(process.name),
      file_paths = VALUES(file.path),
      hosts = VALUES(host.name)
    BY agent_id, host.name, user.name, bucket = DATE_TRUNC(20 minutes, @timestamp)
  | WHERE event_count >= 1
  | KEEP agent_id, bucket, host.name, user.name, event_count, users, processes, file_paths, hosts
  | SORT event_count DESC
enabled: false
tags:
  - attack.defense-evasion
  - attack.privilege-escalation
  - attack.t1548
severity: medium
risk_score: 50
references:
  - "https://research.splunk.com/endpoint/linux_doas_conf_file_creation/"
nist: ["SI-4", "AU-12"]
pci_dss: ["10.2"]
gdpr: ["32.1.b"]
mitre_attack:
  TA0004:
    T1548: []
